import { StaticImageData } from "next/image"
import av from '@/app/_public/a34.webp'
import a53 from '@/app/_public/a53.webp'
import a14 from '@/app/_public/a14.webp'
import a51 from '@/app/_public/a51.webp'
import a24 from '@/app/_public/a24.webp'

import a73 from '@/app/_public/a73.jpg'
import a54 from '@/app/_public/a54.webp'
import a52s from '@/app/_public/a52s.jpg'
import a15 from '@/app/_public/a15.webp'
import a35 from '@/app/_public/a35.jpg'
import a55 from '@/app/_public/a55.webp'

import s23 from '@/app/_public/s23.webp'
import s24 from '@/app/_public/s24.jpg'
import s23ul from '@/app/_public/s23ul.webp'
import s24ul from '@/app/_public/s24ul.webp'

interface Mobile {
    id: number,
    name: string,
    src: StaticImageData,
    details: string,
    price: number
}



export const dataArray: Mobile[] = [
    {
        id: 1, name: 'گوشی موبايل سامسونگ گلکسی A34 5G (SM-A346E/DSN) ظرفیت 128 گیگابایت رم 8 گیگابایت - ویتنام', src: av, details: `
        نوع پردازنده - CPU :

Mediatek Dimensity 1080 (6 نانومتر)

حافظه داخلی :

128 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.6 اینچ

دوربین پشت :

سه گانه 48 مگاپیکسل + 8 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت
        `, price: 14000000
    },
    {
        id: 2, name: 'گوشی موبايل سامسونگ مدل گلکسی A53 5G ظرفیت 256 گیگابایت - رم 8 گیگابایت', src: a53, details: `
        نوع پردازنده - CPU :

Exynos 1280 (5 نانومتر)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.5 اینچ

دوربین پشت :

چهارگانه 64 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`, price: 14000000
    },
    {
        id: 3, name: 'گوشی موبايل سامسونگ گلکسی A24 4G ظرفیت 128 گیگابایت رم 6 گیگابایت - ویتنام', src: a24, details: `نوع پردازنده - CPU :

Mediatek Helio G99 (6 نانومتری)

حافظه داخلی :

128 گیگابایت

حافظه RAM :

6 گیگابایت

سایز صفحه نمایش :

6.5 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 5 مگاپیکسل + 2 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`, price: 14000000
    },
    {
        id: 4, name: 'گوشی موبايل سامسونگ مدل گلکسی A51 ظرفیت 128 گیگابایت - رم 6 گیگابایت', src: a51, details: `نوع پردازنده - CPU :

Exynos 9611 (10 نانومتر)

حافظه داخلی :

128 گيگابايت

حافظه RAM :

6 گیگابایت

سایز صفحه نمایش :

6.5 اینچ

دوربین پشت :

چهارگانه 48 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

4000 میلی آمپر ساعت`, price: 14000000
    },
    {
        id: 5, name: 'گوشی موبایل سامسونگ مدل Galaxy A14 ظرفیت 64 گیگابایت رم 4 گیگابایت', src: a14, details: `نوع پردازنده - CPU :

Mediatek MT6769 Helio G80 (12 nm) Version-A Exynos 850 (8nm) Version-B

حافظه داخلی :

64 گیگابایت

حافظه RAM :

4 گیگابایت

سایز صفحه نمایش :

6.6 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 5 مگاپیکسل + 2 مگاپیکسل

ظرفیت باتری :

5000 میلی‌ آمپر ساعت`, price: 14000000
    },
]

export const mobilesArray2: Mobile[] = [
    {
        id: 1,
        name: 'گوشی موبايل سامسونگ مدل Galaxy A73 5G ظرفیت 256 گیگابایت - رم 8 گیگابایت',
        details: `نوع پردازنده - CPU :

Qualcomm SM7325 Snapdragon 778G 5G (6 nm)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.7 اینچ

دوربین پشت :

چهارگانه 108 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`,
        price: 0,
        src: a73
    },
    {
        id: 2,
        name: 'گوشی موبايل سامسونگ گلکسی A54 5G ظرفیت 256 گیگابایت رم 8 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Exynos 1380 (5 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.4 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`,
        price: 0,
        src: a54
    },
    {
        id: 3,
        name: 'گوشی موبايل سامسونگ مدل Galaxy A52s 5G ظرفیت 128 گیگابایت رم 6 گیگابایت',
        details: `
        نوع پردازنده - CPU :

Qualcomm Snapdragon 778G 5G (6 nm) - هشت هسته ای - یک هسته ی 2.4 گیگاهرتز Kryo 670 Prime و سه هسته 2.2 گیگاهرتز Kryo 670 Gold به همراه چهارهسته 1.9 گیگاهرتز Kryo 670 Silver

حافظه داخلی :

128 گيگابايت

حافظه RAM :

6 گيگابايت

سایز صفحه نمایش :

6.5 اینچ

دوربین پشت :

چهارگانه 64 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

4500 میلی آمپر ساعت`,
        price: 0,
        src: a52s
    },
    {
        id: 4,
        name: 'گوشی موبایل سامسونگ مدل Galaxy A15 4G ظرفیت 128 گیگابایت رم 4 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Mediatek Helio G99 (6nm)

حافظه داخلی :

128 گیگابایت

حافظه RAM :

4 گیگابایت

سایز صفحه نمایش :

6.5 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 5 مگاپیکسل + 2 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`,
        price: 8000000,
        src: a15
    },
    {
        id: 5,
        name: 'گوشی موبايل سامسونگ مدل Galaxy A35 5G ظرفیت 256 گیگابایت رم 8 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Exynos 1380 (5 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.6 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 8 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`,
        price: 10000000,
        src: a35
    },
    {
        id: 6,
        name: 'گوشی موبايل سامسونگ گلکسی A55 5G ظرفیت 256 گیگابایت رم 8 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Exynos 1480 (4 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.6 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 12 مگاپیکسل + 5 مگاپیکسل

ظرفیت باتری :

5000 میلی آمپر ساعت`,
        price: 10000000,
        src: a55
    }
]

export const SMobilesArray: Mobile[] = [
    {
        id: 1,
        name: 'گوشی موبايل سامسونگ مدل Galaxy S23 FE 5G ظرفیت 256 گیگابایت رم 8 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Exynos 2200 (4 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.4 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 8 مگاپیکسل + 12 مگاپیکسل

ظرفیت باتری :

4500 میلی‌ آمپر ساعت`,
        price: 28000000,
        src: s23
    },
    {
        id: 2,
        name: 'گوشی موبايل سامسونگ مدل Galaxy S24 5G ظرفیت 256 گیگابایت رم 8 گیگابایت',
        details: `نوع پردازنده - CPU :

Exynos 2400 (4 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

8 گیگابایت

سایز صفحه نمایش :

6.2 اینچ

دوربین پشت :

سه گانه 50 مگاپیکسل + 10 مگاپیکسل + 12 مگاپیکسل

ظرفیت باتری :

4000 میلی آمپر ساعت`,
        price: 30000000,
        src: s24
    },
    {
        id: 3,
        name: 'گوشی موبایل سامسونگ گلکسی S23 Ultra 5G ظرفیت 256 گیگابایت رم 12 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Qualcomm SM8550-AC Snapdragon 8 Gen 2 (4 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

12 گیگابایت

سایز صفحه نمایش :

6.8 اینچ

دوربین پشت :

200 مگاپیکسل + 12 مگاپیکسل + 10 مگاپیکسل + 10 مگاپیکسل

ظرفیت باتری :

5000 میلی‌ آمپر ساعت`,
        price: 55000000,
        src: s23ul
    },
    {
        id: 4,
        name: 'گوشی موبایل سامسونگ Galaxy S24 Ultra 5G ظرفیت 256 گیگابایت رم 12 گیگابایت - ویتنام',
        details: `نوع پردازنده - CPU :

Qualcomm SM8650-AC Snapdragon 8 Gen 3 (4 نانومتری)

حافظه داخلی :

256 گیگابایت

حافظه RAM :

12 گیگابایت

سایز صفحه نمایش :

6.8 اینچ

دوربین پشت :

چهار گانه 200 مگاپیکسل + 50 مگاپیکسل + 10 مگاپیکسل + 12 مگاپیکسل

ظرفیت باتری :

5000 میلی‌ آمپر ساعت`,
price: 60000000,
src: s24ul
    }
]